Autodesk.Revit.DB.PointOnPlane.Offset
Signed offset from the plane.
Remarks: The point's position
is offset in the direction of the normal vector returned by
the Plane.Normal property.

Autodesk.Revit.DB.PointOnPlane.XVec
The X-coordinate vector of the point, in the
plane's coordinate system.

Autodesk.Revit.DB.PointOnPlane.Position
The coordinates of the point (or its projection)
on the plane.

Autodesk.Revit.DB.PointOnPlane.IsValidPlaneReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Check whether a geometry reference
corresponds to a referenceable plane.
Remarks: Valid plane references include: planar faces
of solids; the PlaneReference properties of
Autodesk.Revit.DB.Level and
Autodesk.Revit.DB.SketchPlane;
the Reference property of
Autodesk.Revit.DB.ReferencePlane.

Autodesk.Revit.DB.PointOnPlane.SetPlaneReference(Autodesk.Revit.DB.Reference)
Change the geometric plane reference.
planeReference: A reference to some plane
in the document. (Note: the reference must satisfy
IsValidPlaneReference(),
but this is not checked until this PointOnPlane object
is assigned to a ReferencePoint.)

Autodesk.Revit.DB.PointOnPlane.GetPlaneReference
The geometric plane reference.
Returns: A copy of the reference stored in the PointOnPlane object.

Autodesk.Revit.DB.PointOnPlane.NewPointOnPlane(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Construct a PointOnPlane given a reference and a location in space.
Returns: A new PointOnPlane object with 2-dimensional Position, XVec, and Offset
properties set to match the given 3-dimensional arguments.
doc: The document containing the plane reference.
position: A 3-dimensional position.
xvec: The direction of the point's
X-coordinate vector in the plane's
coordinates. Optional; default value is the
X-coordinate vector of the plane.

Autodesk.Revit.DB.PointOnPlane
Define a ReferencePoint relative to a planar reference.
Remarks: A ReferencePoint on a plane has its X and Y
basis vectors parallel to the plane, but is free to rotate
around its Z basis vector. It can lie on the plane
or have an offset.